package main

import (
	"net/http"

	"github.com/gin-gonic/gin"
)

func main() {
	router := gin.Default()
	router.GET("/", func(c *gin.Context) {
		if c.ClientIP() == "115.227.8.230" {
			c.JSON(http.StatusOK, gin.H{
				"version":   "0.3.2",
				"changelog": "别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n",
				"notice":    "别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n",
			})
			return
		}
		c.JSON(http.StatusOK, gin.H{
			"version":   "0.3.3",
			"changelog": "适配了更多的推送方式，配置详见文档：https://xiaomiku01.github.io/fansMedalHelperVersion/\n\n 增加弹幕打卡是自动切换到当前房间的粉丝牌，避免出现房间有粉丝牌等级禁言的限制\n\n修复了一些小BUG\n\n",
			"notice":    "",
		})
	})
	router.Run(":9000")
}
