package main

import (
	"net/http"

	"github.com/gin-gonic/gin"
)

func main() {
	router := gin.Default()
	router.GET("/", func(c *gin.Context) {
		if c.ClientIP() == "115.227.8.230" {
			c.JSON(http.StatusOK, gin.H{
				"version":   "0.3.4",
				"changelog": "别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n",
				"notice":    "别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n别爬你爹了,别爬你爹了,别爬你爹了,别爬你爹了\n",
			})
			return
		}
		c.JSON(http.StatusOK, gin.H{
			"version":   "0.3.4",
			"changelog": "修复了获取粉丝牌失败导致的异常BUG  \n",
			"notice":    "",
		})
	})
	router.Run(":9000")
}
